docs/leets/0819-Most-Common-Word.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- 2024-12-29 -->
<meta charset="utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>0819. Most Common Word</title>
<meta name="author" content="d)zharii" />
<meta name="generator" content="Org Mode" />
<meta name="viewport" content="width=device-width, initial-scale=1.0">
<link rel="stylesheet" href="/static/t.css"/>
</head>
<body>
<nav><a href="/" tabindex="0">&larrhk; Back to Index</a></nav><div id="preamble" class="status">
Published 2024-12-28
</div>
<div id="content" class="content">
<header>
<h1 class="title">0819. Most Common Word</h1>
<p class="subtitle" role="doc-subtitle">leetcode</p>
</header><nav id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org2752b0d">Problem</a></li>
<li><a href="#org29edafb">Solution Description</a></li>
<li><a href="#org8a19518">Example</a></li>
<li><a href="#orgc787d71">References</a></li>
<li><a href="#orgbeeafc7">Solution</a></li>
</ul>
</div>
</nav>

<div id="outline-container-org2752b0d" class="outline-2">
<h2 id="org2752b0d">Problem</h2>
<div class="outline-text-2" id="text-org2752b0d">
<p>
Given a paragraph and a list of banned words, your task is to find the most frequently occurring word that is not in the list of banned words. The word must be considered independently of punctuation and case.
</p>

<p>
Assume:
</p>
<ul class="org-ul">
<li>The paragraph will consist of English letters, space, or punctuation marks.</li>
<li>There will be no words longer than 10 characters.</li>
<li>The paragraph will be non-empty.</li>
</ul>
</div>
</div>

<div id="outline-container-org29edafb" class="outline-2">
<h2 id="org29edafb">Solution Description</h2>
<div class="outline-text-2" id="text-org29edafb">
<p>
To implement this solution, we need to:
</p>

<ol class="org-ol">
<li>Normalize the input by converting all characters in the paragraph to lower case and replacing punctuation with spaces.</li>
<li>Split the normalized paragraph into individual words.</li>
<li>Use an object or Map to count occurrences of each word, ignoring any word that is in the list of banned words.</li>
<li>Determine the word with the maximum count that is not banned.</li>

<li>Time Complexity: O(n + m) where n is the length of the paragraph and m is the number of words in the banned list, as parsing the paragraph and looking up the banned list is linear.</li>
<li>Space Complexity: O(k) where k is the number of unique words in the paragraph minus banned words, to store the count of each word.</li>
</ol>
</div>
</div>

<div id="outline-container-org8a19518" class="outline-2">
<h2 id="org8a19518">Example</h2>
<div class="outline-text-2" id="text-org8a19518">
<p>
For a paragraph <code>"Bob hit a ball, the hit BALL flew far after it was hit."</code> and a banned list <code>["hit"]</code>,
</p>
<ul class="org-ul">
<li>Normalize into <code>["bob", "hit", "a", "ball", "the", "hit", "ball", "flew", "far", "after", "it", "was", "hit"]</code>.</li>
<li>Exclude <code>"hit"</code> from counting.</li>
<li>Count the occurrences: <code>{"bob": 1, "a": 1, "ball": 2, "the": 1, "flew": 1, "far": 1, "after": 1, "it": 1, "was": 1}</code>.</li>
<li>Determine that "ball" with a count of 2 is the most frequent.</li>
</ul>
</div>
</div>

<div id="outline-container-orgc787d71" class="outline-2">
<h2 id="orgc787d71">References</h2>
<div class="outline-text-2" id="text-orgc787d71">
<p>
For parsing and filtering words, you might look into JavaScript's <code>String</code> and <code>RegExp</code> methods for processing strings, and <code>Map</code> or objects for counting.
</p>
</div>
</div>

<div id="outline-container-orgbeeafc7" class="outline-2">
<h2 id="orgbeeafc7">Solution</h2>
<div class="outline-text-2" id="text-orgbeeafc7">
<p>
<a href="https://leetcode.com/problems/most-common-word/submissions/1491292912/">2024-12-29 Most Common Word - LeetCode</a> <code>leetcode.com</code>
</p>

<div class="org-src-container">
<pre class="src src-js">
/**
 * Returns the most common word in the paragraph that is not banned.
 * @param {string} paragraph - The input paragraph.
 * @param {string[]} banned - List of banned words.
 * @return {string} The most frequent non-banned word.
 */
function mostCommonWord(paragraph, banned) {
    const log = typeof NestedInteger !== 'undefined' ? () =&gt; {} : console.log;
    const table = typeof NestedInteger!== 'undefined' ? () =&gt; {} : console.table;

    /**
     * Creates a histogram (word frequency count) from a given text,
     * excluding any words present in a banned set.
     *
     * @param {string} text - The input text from which to create the histogram.
     * @param {Set&lt;string&gt;} bannedSet - A set of words to be excluded from the histogram.
     * @returns {Object} An object representing the histogram where keys are words
     * and values are their respective counts.
     */
    function makeHistogram(text, bannedSet) {
        const lower = (text || '').toLowerCase();
        const histogram = {};
        const words = lower.split(/[^a-zA-Z]+/);
        // table(words);
        for (const word of words) {
            if (!word) continue;
            if (bannedSet.has(word)) continue;

            histogram[word] = word in histogram ? histogram[word] + 1 : 1;
        }
        return histogram;
    }

    const bannedSet = new Set(banned.map(word =&gt; word.toLowerCase()));
    const histogram = makeHistogram(paragraph, bannedSet);

    let maxWord = null;
    let maxFreq = 0;

    for (const [word, freq] of Object.entries(histogram)) {
        if (maxFreq &lt; freq) {

            maxFreq = freq;
            maxWord = word;
        }
    }


    return maxWord;
}

// Test cases
const testCases = [
    {
        paragraph: "..Bob hit a ball, the hit BALL flew far after it was hit.",
        banned: ["hit"],
        expected: "ball"
    },
    {
        paragraph: "Bob hit a ball, the hit BALL flew far after it was hit.",
        banned: ["hit"],
        expected: "ball"
    },
    {
        paragraph: "a.",
        banned: [],
        expected: "a"
    },
    {
        paragraph: "a, a, a, a, b,b,b,c, c",
        banned: ["a"],
        expected: "b"
    },
    {
        paragraph: "It was the best of times, it was the worst of times, it was the age of wisdom.",
        banned: ["the", "of"],
        expected: "it"
    },
    {
        paragraph: "apple apple banana, banana ban apple.",
        banned: ["banana"],
        expected: "apple"
    }
];

testCases.forEach((test, index) =&gt; {
    const result = mostCommonWord(test.paragraph, test.banned);
    console.log(`Test Case ${index + 1}: ${result === test.expected ? 'Passed' : 'Failed'} (Expected: '${test.expected}', Got: '${result})'`);
});

</pre>
</div>


<pre class="example" id="orgb8f8558">
#+RESULTS:
: Test Case 1: Passed (Expected: ball, Got: ball)
: Test Case 2: Passed (Expected: a, Got: a)
: Test Case 3: Passed (Expected: b, Got: b)
: Test Case 4: Passed (Expected: it, Got: it)
: Test Case 5: Passed (Expected: apple, Got: apple)
: undefined
</pre>
</div>
</div>
</div>
<div id="postamble" class="status">
&copy; d)zharii. <a href="/sitemap.html">sitemap</a>
</div>
</body>
</html>
